Voorbeeldberichten/uitgifteservice/02_DC_Request_Cirkel_error.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <dispatchCharacteristicsRequest 
                xmlns="http://www.broservices.nl/xsd/dsepc/1.0"
                xmlns:brocom="http://www.broservices.nl/xsd/brocommon/3.0"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsepc/1.0 https://raw.githubusercontent.com/BROprogramma/EPC/master/XSD/dsepc-messages.xsd"
            >
            <!-- Disclaimer: dit voorbeeldbericht valideert tegen de XSD van de uitgifteservice.
                 Het houdt geen rekening met bedrijfsregels en is mogelijkerwijs vaktechnisch/inhoudelijk niet voorbeeldig.
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsepc/1.0 https://schema.broservices.nl/xsd/dsepc/1.0/dsepc-messages.xsd"
            -->
            <brocom:requestReference>uitgifte-kengegevens3</brocom:requestReference>
            <criteria>
                <brocom:area>
                    <brocom:enclosingCircle srsName="">
                        <brocom:center>50.8 5.9</brocom:center>
                        <brocom:radius uom="km">20</brocom:radius>
                    </brocom:enclosingCircle>
                </brocom:area>
            </criteria>
        </dispatchCharacteristicsRequest>
    </soap:Body>
</soap:Envelope>
